<?php
#============================================
# Разные полезные функции
# (c) Zkir 2012
#============================================		
Function GetMapGroup($strCountryCode)
{
    switch ($strCountryCode)
    {
        case 'RU':
            $result="Россия";
            break;
        
        case "EU": //Евромаршруты
         
        case "AT": //Австрия
        case "BE": //Бельгия
        case "GB": //Великобритания
        case "DE": //Германия
        case "IE": //Ирландия
        case "IM": //остров Мэн
        case "LI": //Лихтенштейн
        case "LU": //Люксембург
        case "MC": //Монако
        case "NL": //Нидерланды
        case "FR": //Франция
        case "CH": //Швейцария

        case "BY": //Беларусь
        case "BG": //Болгария
        case "HU": //Венгрия
        case "MD": //Молдавия
        case "PL": //Польша  
        case "RO": //Румыния
        case "SK": //Словакия   
        case "CZ": //Чехия
        case "UA": //Украина

        case "DK": //Дания
        case "IS": //Исландия
        case "LV": //Латвия
        case "LT": //Литва
        case "NO": //Норвегия
        case "FI": //Финляндия
        case "EE": //Эстония
        case "SE": //Швеция

        case "AD": //Андора
        case "AL": //Албания
        case "BA": //Босния и Герцеговина
        case "GR": //Греция
        case "ES": //Испания
        case "GI": //Гибралтар
        case "IT": //Италия
        case "MK": //Македония          	  
        case "MT": //Мальта
        case "PT": //Португалия
        case "SM": //Сан-Марино
        case "RS": //Сербия
        case "SI": //Словения
        case "HR": //Хорватия           	  
        case "ME": //Черногория

        case "CY": //Кипр
        case "FO": //Фарерские о-ва
        
            $result="Европа";
            break;
            
        case "AB": //Абхазия   
        case "AE": //ОАЭ
        case "AF": //Афганистан
        case "AM": //Армения
        case "AZ": //Азербайджан
        case "BD": //Бангладеш
        case "BH": //Бахрейн
        case "CN": //Китай
        case "IR": //Иран
        case "IQ": //Ирак
        case "GE": //Грузия
        case "HK": //Гонконг
        case "IL": //Израиль
        case "IN": //Индия
        case "JP": //Япония
        case "KH": //Камбоджа
        case "KP": //Северная Корея
        case "KR": //Южная Корея
        case "KZ": //Казахстан
        case "KG": //Киргизстан
        case "LK": //Шри-Ланка
        case "MN": //Монголия
        case "MY": //Малайзия
        case "OS": //Южная Осетия
        case "PH": //Филиппины
        case "PK": //Пакистан
        case "QA": //Катар
        case "SA": //Саудовская Аравия
        case "TH": //Таиланд
        case "TM": //Туркменистан
        case "TJ": //Таджикистан
        case "TR": //Турция
        case "VN": //Вьетнам
        case "UZ": //Узбекистан
        	        	
            $result="Азия";
            break;
        default:
            $result="Остальной мир";
            break;
    }

return $result;
}
//=====================================================================================
// Описания тестов 
//=====================================================================================	
function GetDeadEndsTestDescription()
{
  $str=_('В этом тесте показываются тупики дорог trunk, primary и secondary.').
  	   _('Основная идея очень простая: важная дорога не может просто так (посереди поля) заканчиваться, а должна куда-то вести.').
       _('Тупиковый участок, т.е. участок после последнего перекрестка, по определению не имеет никакого значения, кроме местного.'). 
       _('Таким образом тупики - это ошибки присвоения статусов.').'<BR />'.
       _('В случае же, если статусы расставлены правильно, данный тест позволяет обнаруживать <b>серьезные дефекты</b> дорожного графа, такие как <b>разрывы</b> (выпадение сегментов) <b>несоединенные вершины</b> и даже <b>нерутинговые паромы</b>.').'<br />'.
       _('Разумеется, этот тест применим только для стран, для которых принята классификация дорог по значимости');	
  
  return $str;
}

//=====================================================================================
// Навигатор по тестам с картой 
//=====================================================================================	

function PrintTestNavigator($mapid)
{
  global $zPage;
  $zPage->WriteHtml('<table cellpadding="6px" width="100%">
  	                   <tr>
  	                     <td><b> Тест адрески,<br/> дома </b></td><td><b> Тест адрески,<br/> улицы </b></td>
  	                     <td><b> Изолированные <br /> рутинговые подграфы </b></td><td><b> Тупики <br/>магистралей </b></td> 
  	                     <td><b> Дубликаты <br/>ребер </b></td>  <td><b> Просроченные <br />строящиеся дороги</b></td>
  	                   </tr>
  	                   <tr>
                         <td><a href="/qa/'.$mapid.'/addr-map">На карте</a></td>
  	                     <td><a href="/qa/'.$mapid.'/addr-street-map">На карте</a></td>
  	                     <td><a href="/qa/'.$mapid.'/routing-map">На карте</a></td> 
  	                     <td><a href="/qa/'.$mapid.'/dnodes-map">На карте</a></td>
  	                     <td><a href="/qa/'.$mapid.'/rd-map">На карте</a></td>
  	                     <td><a href="/qa/'.$mapid.'/hwc-map">На карте</a></td>
  	                   </tr>
  	                   <tr>
  	                     <td><a href="/qa/'.$mapid.'#addr">Список</a></td>
  	                     <td><a href="/qa/'.$mapid.'#addr-street">Список</a></td>
  	                     <td><a href="/qa/'.$mapid.'#isol">Список</a></td> 
  	                     <td><a href="/qa/'.$mapid.'#deadends">Список</a></td> 
  	                     <td><a href="/qa/'.$mapid.'#rdups">Список</a></td>
  	                     <td><a href="/qa/'.$mapid.'#hwconstr_chk">Список</a></td>
  	                   </tr>
  	                 </table>' );
  
  $zPage->WriteHtml('<p><a href="/qa/'.$mapid.'">К сводному отчету по данной карте('.$mapid.')</a><br/>');
  $zPage->WriteHtml('<a href="/qa">Назад к списку регионов</a></p>');	  
}
?>