Repository: Zkir/osm2dcm
Catalog: osrm_fixme/locale/*/LC_MESSAGES/fixme.po
Languages: ru_ru

source: Fixme - inaccessible road
ru_ru: Почини меня - недоступные ребра

source: So that is what inaccessible road is!
ru_ru: Так вот ты какое, недоступное ребро!

source: Where am I?
ru_ru: Что это такое?

source: This page displays the road segments, which for various reasons are <i>inaccessible</i> (they are also called "not route-able parts of the road network").
ru_ru: На этой странице представлены участки дорог, на которые по разным причинам невозможно заехать (если по-умному, «ребра дорожного графа, недоступные для рутинга»).

source: In most cases these are errors in the OSM data which can and should be corrected.
ru_ru: В большинстве случаев они возникают из-за ошибок редакторов карты.

source: Where this data is taken from?
ru_ru: Откуда взялись эти данные?

source: Data analysis is performed by the %s project.
ru_ru: Анализ дорог в OSM проведен проектом %s.

source: What should I do?
ru_ru: Что мне делать?

source: Please press F5. This page will refresh, and one of the problematic routing edges will be displayed.
ru_ru: Нажмите F5. Страница обновится, и на карте покажется одно из проблемных ребр.

source: If Josm is running, this place will be automaticaly loaded into Josm for editing.
ru_ru: Если Josm запущен, этот участок карты автоматически загрузится в Josm для редактирования.

source: Make sure that Josm Remote Control is activated. You can also try 'manual' link below the map.
ru_ru: Если Josm не загружает это место, можно попробовать ручную ссылку на Josm под картой.

source: If you see something suspicious, like %sisolated roads, or oneway roads where it is possible to drive out but not drive in and vice-versa, or just roads that are not properly connected by common nodes%s, <i>please fix</i> :)
ru_ru: Если заметно что-то подозрительное (%sоторванные от основного графа куски дорог, односторонние дороги, на которые есть только въезд или только выезд, или просто несоединенные, где надо, вершины%s), <i>почините</i> :)

source: After that, please press F5 again - the next road segment will be displayed.
ru_ru: После этого нажмите F5 - отобразится следующий сегмент.

source: Please show me the next problem!
ru_ru: Покажите следующую проблему!

source: Statistics
ru_ru: Статистика

source: World-wide, inaccessible road segments : %s, touched today: %s.
ru_ru: Во всем мире, недоступных сегментов дорог: %s, показано сегодня: %s.

source: In the current campaign, inaccessible road segments: %s, touched today: %s.
ru_ru: В текущей окрестности, недоступных сегментов дорог: %s, показано сегодня: %s.

source: This page is dedicated to the benefit of all living creatures.
ru_ru: Посвящаем созданную этой страницей заслугу благу всех живых существ.

source: Komzpa, Zkir, OsRM and other contributors of the %s project, СС-BY-SA, ODBL and all other magical incantations applicable in this case.
ru_ru: Komzpa, Zkir, OsRM и другие участники проекта %s, СС-BY-SA, ODBL и прочее, и прочее, что применимо в данном случае.

source: Original page
ru_ru: Оригинальная страница

source: How to fix instructions
ru_ru: Инструкции как починить

source: Forum thread (ru)
ru_ru: Обсуждение на форуме (ru)

source: This place at osm.org
ru_ru: Это место на osm.org

source: Permalink
ru_ru: Постоянная ссылка
